
// If you use this compiled emoji list. Please credit ClubLink and link back to here in your code and repo

const emojiList = {
    爰: "<:cc_heart:1065391639541072014>", // ❤️
    助: "<:cc_orange_heart:1065391658482548736>", // 🧡
    删: "<:cc_yellow_heart:1065391687955923004>", // 💛
    具: "<:cc_green_heart:1065391716665929800>", // 💚
    肟: "<:cc_blue_heart:1065391834064498698>", // 💙
    烧: "<:cc_purple_heart:1065391857368059964>", // 💜
    烠: "<:cc_white_heart:1065391891786506250>", // 🤍
    烽: "<:cc_arrow_up:1053942800586113054>", // ⬆️
    篾: "<:cc_arrow_left:1053943321711624222>", // ⬅️
    燔: "<:cc_arrow_right:1053943301235015700>", // ➡️
    脎: "<:cc_arrow_down:1053942853992185857>", // ⬇️
    然: "<:cc_smile:1053942910166519808>", // 😀
    肱: "<:cc_frown:1053942959889985587>", // ☹️
    肽: "<:cc_sad:1053943023366578237>", // 😞
    网: "<:cc_upside_down:1053943070074339348>", // 🙃
    少: "<:cc_angry:1053943116312367166>", // 😠
    燠: "<:cc_heart_eyes:1053943217046945872>", // 😍\
    箅: "<:cc_sob:1053943361825939537>", // 😭
    粤: "<:cc_shocked:1053943380352192542>", // 😯
    咖: "<:cc_tongue:1053943399226540083>", // 😛
    刚: "<:cc_kiss:1053942828314677268>", // 😘
    腌: "<:cc_straight_face:1053942879111880845>", // 😐
    胯: "<:cc_grin:1053942936301228172>", // 😁
    军: "<:cc_cool:1053943044824637480>", // 😎
    煅: "<:cc_nerd:1065392275674366124>", // 🤓
    劣: "<:cc_wink:1065392223144919101>", // 😉
    炘: "<:cc_smirk:1065392192757170286>", // 😏
    鄱: "<:cc_exhausted:1065392157671829554>", // 🥵
    翻: "<:cc_clown:1065391921985503312>", // 🤡
    肋: "<:cc_cold:1053943097014353963>", // 🥶
    烙: "<:cc_sick:1053943160063131678>", // 🤢
    煌: "<:cc_rage:1053943178681655336>", // 😡
    胰: "<:cc_purple_devil:1053942996112003123>", // 😈
    鹠: "<:cc_skull:1065391946840936539>", // 💀
    烀: "<:cc_eyes:1053943199061782568>", // 👀 
    烅: "<:cc_thumbs_up:1053943249389240390>", // 👍
    省: "<:cc_thumbs_down:1053943275125481502>", // 👎
    箩: "<:cc_sus:1053943344004333639>", // 🔪
    吊: "<:cc_moneybag:1053943428221771786>", // 💰
    // �: "<:cc_fire:1065391991275397160>", // 🔥
    熘: "<:cc_gg:1065392296243232798>", // GG
    臼: "<:cc_100:1065391967602741249>", // 💯
    舅: "<:cc_w:1065392082916745256>", // W
    肝: "<:cc_l:1065391621019013240>", // L
    // 煳: "", // 😳
    尖: "<:cc_lip_bite:1065392021084328067>", // 🫦
    公: "<:cc_coins:1071636319220019212>", // 🪙
    枻: "<:cc_exp:1071636352619257956>", // 🟦
}

/**
 *
 * @param {String} input The character used by Mineclub resource pack
 * @return {String} Discord emoji
 */

function emojiConvert(input) {
	return emojiList[input];
}

module.exports = { emojiList, emojiConvert };
